ljgabc/rtthread/bsp/n32g003/library/n32g003.h
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g003.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/
#ifndef __N32G003_H__
#define __N32G003_H__

#ifdef __cplusplus
extern "C" {
#endif


/***  N32G003_Library_Basic ***/

#if !defined USE_STDPERIPH_DRIVER
/** Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers **/
#define USE_STDPERIPH_DRIVER
#endif


#define HSI_VALUE   ((uint32_t)48000000) /* Value of the Internal oscillator in Hz*/
#define HSI_40M     ((uint32_t)40000000)   
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x0500) /* Time out for HSI start up */

/** n32g003 Standard Peripheral Library version number **/
#define __n32g003_STDPERIPH_VERSION_MAIN   (0x01) /* [31:24] main version */
#define __n32g003_STDPERIPH_VERSION_SUB1   (0x00) /* [23:16] sub1 version */
#define __n32g003_STDPERIPH_VERSION_SUB2   (0x00) /* [15:8]  sub2 version */
#define __n32g003_STDPERIPH_VERSION_RC     (0x00) /* [7:0]  release candidate */
#define __n32g003_STDPERIPH_VERSION        ( (__n32g003_STDPERIPH_VERSION_MAIN << 24)\
                                           |(__n32g003_STDPERIPH_VERSION_SUB1 << 16)\
                                           |(__n32g003_STDPERIPH_VERSION_SUB2 << 8)\
                                           |(__n32g003_STDPERIPH_VERSION_RC))

/** Configuration of the Cortex-M0 Processor and Core Peripherals **/
#define __NVIC_PRIO_BITS          2 /* N32G003 uses 2 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0 /* Set to 1 if different SysTick Config is used */

/*** N32G003 Interrupt Number Definition ***/

typedef enum IRQn
{
  /** Cortex-M0 Processor Exceptions Numbers **/
  NonMaskableInt_IRQn         = -14,    /* 2 Non Maskable Interrupt                                */
  HardFault_IRQn              = -13,    /* 3 Cortex-M0 Hard Fault Interrupt                        */
  SVC_IRQn                    = -5,     /* 11 Cortex-M0 SV Call Interrupt                          */
  PendSV_IRQn                 = -2,     /* 14 Cortex-M0 Pend SV Interrupt                          */
  SysTick_IRQn                = -1,     /* 15 Cortex-M0 System Tick Interrupt                      */

  /** N32G003 specific Interrupt Numbers  **/
  PVD_IRQn                    = 0,      /* PVD through EXTI Line 18 detect Interrupt               */
  FLASH_IRQn                  = 1,      /* FLASH Interrupt                                         */
  EXTI0_1_IRQn                = 2,      /* EXTI Line 0 and 1 Interrupts                            */
  EXTI2_3_IRQn                = 3,      /* EXTI Line 2 and 3 Interrupts                            */
  EXTI4_17_IRQn               = 4,      /* EXTI Line 4 to 17 Interrupts                            */
  TIM1_BRK_UP_TRG_COM_IRQn    = 5,      /* TIM1 Break, Update, Trigger and Commutation Interrupts  */
  TIM1_CC_IRQn                = 6,      /* TIM1 Capture Compare Interrupt                          */
  TIM3_IRQn                   = 7,      /* TIM3 Interrupt                                          */
  TIM6_IRQn                   = 8,      /* TIM6 through EXTI Line 19 Interrupt                     */
  ADC_IRQn                    = 9,      /* ADC global Interrupt                                    */
  I2C_EV_IRQn                 = 10,     /* I2C event Interrupt                                     */
  I2C_ER_IRQn                 = 11,     /* I2C error Interrupt                                     */
  SPI_IRQn                    = 12,     /* SPI Interrupt                                           */
  UART1_IRQn                  = 13,     /* UART1 Interrupt                                         */
  UART2_IRQn                  = 14,     /* UART2 Interrupt                                         */
  COMP_IRQn                   = 15      /* COMP Interrupt                                          */
} IRQn_Type;

