ljgabc/rtthread/bsp/n32g003/library/n32g003.h
#include "bsp/n32g003/cmsis/core_cm0.h"
#include "bsp/n32g003/system/system_n32g003.h"
#include <stdint.h>
#include <stdbool.h>

/* n32g003 Standard Peripheral Library old types (maintained for legacy purpose) */
typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /* Read Only */
typedef const int16_t sc16;  /* Read Only */
typedef const int8_t sc8;   /* Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /* Read Only */
typedef __I int16_t vsc16;  /* Read Only */
typedef __I int8_t vsc8;   /* Read Only */

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /* Read Only */
typedef const uint16_t uc16;  /* Read Only */
typedef const uint8_t uc8;   /* Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /* Read Only */
typedef __I uint16_t vuc16;  /* Read Only */
typedef __I uint8_t vuc8;   /* Read Only */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/* n32g003 Standard Peripheral Library definitions (maintained for legacy purpose) */
#define HSI_Value            HSI_VALUE

/*** Analog to Digital Converter ***/
typedef struct
{
    __IO uint32_t STS;
    __IO uint32_t CTRL1;
    __IO uint32_t CTRL2;
    __IO uint32_t CTRL3;
    __IO uint32_t SAMPT;
    __IO uint32_t WDGHIGH;
    __IO uint32_t WDGLOW;
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;

} ADC_Module;


/*** CRC calculation unit ***/
typedef struct
{
    uint32_t      RESERVED0;
    uint32_t      RESERVED1;
    uint32_t      RESERVED2;
    __IO uint8_t  CRC16CTRL;
    uint8_t       RESERVED3;
    uint16_t      RESERVED4;
    __IO uint8_t  CRC16DAT;
    uint8_t       RESERVED5;
    uint16_t      RESERVED6;
    __IO uint16_t CRC16D;
    uint16_t      RESERVED7;
    __IO uint8_t  LRC;
    uint8_t       RESERVED8;
    uint16_t      RESERVED9;
} CRC_Module;



/***  External Interrupt/Event Controller ***/

typedef struct
{
   __IO uint32_t IMASK;   
   __IO uint32_t EMASK;   
   __IO uint32_t RT_CFG;  
   __IO uint32_t FT_CFG;   
   __IO uint32_t SWIE;     
   __IO uint32_t PEND;     
} EXTI_Module;

/*** FLASH Registers ***/

typedef struct
{
  __IO uint32_t AC;
  __IO uint32_t KEY;
  __IO uint32_t OPTKEY;
  __IO uint32_t STS;
  __IO uint32_t CTRL;
  __IO uint32_t ADD;
  __IO uint32_t RESERVED0;
  __IO uint32_t OB;
  __IO uint32_t USER;
  __IO uint32_t VTOR;
} FLASH_Module;

/*** Option Bytes Registers ***/

typedef struct
{
  __IO uint32_t USER_RDP;
  __IO uint32_t Data1_Data0;
  __IO uint32_t USER3_USER2;
  __IO uint32_t USER4_RDP2;
} OB_Module;

/** General Purpose I/O **/

typedef struct
{
    __IO uint32_t PMODE;
    __IO uint32_t POTYPE;
    __IO uint32_t SR;
    __IO uint32_t PUPD;
    __IO uint32_t PID;
    __IO uint32_t POD;
    __IO uint32_t PBSC;
    __IO uint32_t PLOCK;
    __IO uint32_t AFL;
    __IO uint32_t AFH;
    __IO uint32_t PBC;
    __IO uint32_t DS;
} GPIO_Module;

/** Alternate Function I/O **/

typedef struct
{
    __IO uint32_t CFG;
} AFIO_Module;


/***  Inter Integrated Circuit Interface ***/

typedef struct
{
  __IO uint16_t CTRL1;
  uint16_t  RESERVED0;
  __IO uint16_t CTRL2;
  uint16_t  RESERVED1;
  __IO uint16_t OADDR1;
  uint16_t  RESERVED2;
  __IO uint16_t OADDR2;
  uint16_t  RESERVED3;
  __IO uint16_t DAT;
  uint16_t  RESERVED4;
  __IO uint16_t STS1;
  uint16_t  RESERVED5;
  __IO uint16_t STS2;
  uint16_t  RESERVED6;
  __IO uint16_t CLKCTRL;
  uint16_t  RESERVED7;
  __IO uint16_t TMRISE;
  uint16_t  RESERVED8;
  __IO uint16_t GFLTRCTRL;
  uint16_t  RESERVED9;
  __IO uint16_t BYTENUM;
} I2C_Module;


/***  Beeper  ***/

typedef struct
{
  __IO uint32_t CTRL;
} BEEPER_Module;


/*** Independent watchdog ***/

typedef struct
{
  __IO uint32_t KEY;
  __IO uint32_t PREDIV;
  __IO uint32_t RELV;
  __IO uint32_t STS;
  __IO uint32_t FREEZE;
} IWDG_Module;

/*** Power Control ***/
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CTRLSTS;
    __IO uint32_t CTRL2;
    uint32_t      RESERVED0;
    uint32_t      RESERVED1;
    __IO uint32_t CTRL3;
    uint32_t      RESERVED2;
    uint32_t      RESERVED3;
    __IO uint32_t CTRL4;
    __IO uint32_t CTRL5;
    __IO uint32_t CTRL6;
    uint32_t      RESERVED4;
    __IO uint32_t DBG_CTRL;
} PWR_Module;

/*** Reset and Clock Control ***/

typedef struct
{
  __IO uint32_t HSICTRL;
  __IO uint32_t CFG;
  __IO uint32_t Reserve0;
  __IO uint32_t PRST;
  __IO uint32_t AHBPCLKEN;
  __IO uint32_t APBPCLKEN;
  __IO uint32_t LSICTRL;
  __IO uint32_t CTRLSTS;
  __IO uint32_t CFG2;
  __IO uint32_t EMCCTRL;
} RCC_Module;


/*** compare ***/

typedef struct
{
  __IO uint32_t INTEN;
  __IO uint32_t INTSTS;
  uint32_t  RESERVED0;
  __IO uint32_t LOCK;
  __IO uint32_t CTRL;
  __IO uint32_t FILC;
  __IO uint32_t FILP;
}COMP_Module;



/*** Serial Peripheral Interface ***/

typedef struct
{
    __IO uint16_t CTRL1;
    uint16_t RESERVED0;
    __IO uint16_t CTRL2;
    uint16_t RESERVED1;
    __IO uint16_t STS;
    uint16_t RESERVED2;
    __IO uint16_t DAT;
    uint16_t RESERVED3;
} SPI_Module;


/*** TIM ***/

typedef struct
{
  __IO uint32_t CTRL1;
  __IO uint32_t CTRL2;
  __IO uint16_t SMCTRL;
  uint16_t  RESERVED1;
  __IO uint16_t DINTEN;
  uint16_t  RESERVED2;
  __IO uint32_t STS;
  __IO uint16_t EVTGEN;
  uint16_t  RESERVED3;
  __IO uint16_t CCMOD1;
  uint16_t  RESERVED4;
  __IO uint16_t CCMOD2;
  uint16_t  RESERVED5;
  __IO uint32_t CCEN;
  __IO uint16_t CNT;
  uint16_t  RESERVED6;
  __IO uint16_t PSC;
  uint16_t  RESERVED7;
  __IO uint16_t AR;
  uint16_t  RESERVED8;
  __IO uint16_t REPCNT;
  uint16_t  RESERVED9;
  __IO uint16_t CCDAT1;
  uint16_t  RESERVED10;
  __IO uint16_t CCDAT2;
  uint16_t  RESERVED11;
  __IO uint16_t CCDAT3;
  uint16_t  RESERVED12;
  __IO uint16_t CCDAT4;
  uint16_t  RESERVED13;
  __IO uint16_t BKDT;
  uint16_t  RESERVED14;
  uint32_t  RESERVED15;
  uint32_t  RESERVED16;
  uint32_t  RESERVED17;
  __IO uint16_t CCMOD3;
  uint16_t  RESERVED18;
  __IO uint16_t CCDAT5;
  uint16_t  RESERVED19;
  uint32_t  RESERVED20;
} TIM_Module;



/*** Universal Asynchronous Receiver Transmitter ***/
typedef struct
{
    __IO uint16_t STS;
    uint16_t  RESERVED0;
    __IO uint16_t DAT;
    uint16_t  RESERVED1;
    __IO uint16_t BRCF;
    uint16_t  RESERVED2;
    __IO uint16_t CTRL1;
    uint16_t  RESERVED3;
    __IO uint16_t CTRL2;
    uint16_t  RESERVED4;
    __IO uint16_t CTRL3;
    uint16_t  RESERVED5;
} UART_Module;




