ljgabc/rtthread/bsp/n32g003/library/n32g003.h
/*** Peripheral memory map ***/

#define FLASH_BASE            ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define UCID_BASE           ((uint32_t)0x1FFFF4D0) /* UCID Address : 0x1FFF_F7C0 */
#define UCID_LENGTH         ((uint32_t)0x10)       /* UCID Length  : 16 Bytes */
#define UID_BASE            ((uint32_t)0x1FFFF4FC) /* UID Address  : 0x1FFF_F7F0 */
#define UID_LENGTH          ((uint32_t)0x0C)       /* UID Length   : 12 Bytes */
#define DBGMCU_ID_BASE      ((uint32_t)0x1FFFF508) /* DBGMCU_ID Address :0x1FFF_F508 */
#define DBGMCU_ID_LENGTH    ((uint8_t)0x04)				/* DBGMCU_ID Length : 4 Bytes */


/** Peripheral memory map **/
#define APBPERIPH_BASE        (PERIPH_BASE)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)

/** APB1 **/
#define TIM3_BASE             (APBPERIPH_BASE + 0x0400)
#define TIM1_BASE             (APBPERIPH_BASE + 0x0C00)
#define TIM6_BASE             (APBPERIPH_BASE + 0x1000)
#define AFIO_BASE             (APBPERIPH_BASE + 0x1400)
#define GPIOA_BASE            (APBPERIPH_BASE + 0x1C00)
#define GPIOB_BASE            (APBPERIPH_BASE + 0x2000)
#define COMP_BASE             (APBPERIPH_BASE + 0x2400)
#define IWDG_BASE             (APBPERIPH_BASE + 0x2C00)
#define EXTI_BASE             (APBPERIPH_BASE + 0x3400)
#define BEEPER_BASE           (APBPERIPH_BASE + 0x3800)
#define UART1_BASE            (APBPERIPH_BASE + 0x4400)
#define UART2_BASE            (APBPERIPH_BASE + 0x4800)
#define I2C_BASE              (APBPERIPH_BASE + 0x5400)
#define SPI_BASE              (APBPERIPH_BASE + 0x5800)
#define PWR_BASE              (APBPERIPH_BASE + 0x7000)


/** AHB **/
#define ADC_BASE              (AHBPERIPH_BASE + 0x0800)
#define RCC_BASE              (AHBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000) /* Flash registers base address */
#define OB_BASE               ((uint32_t)0x1FFFF600)    /* Flash Option Bytes base address */
#define CRC_BASE              (AHBPERIPH_BASE + 0x3000)


/** Peripheral_declaration **/

#define BEEPER              ((BEEPER_Module *) BEEPER_BASE)
#define TIM1                ((TIM_Module *) TIM1_BASE)
#define TIM3                ((TIM_Module *) TIM3_BASE)
#define TIM6                ((TIM_Module *) TIM6_BASE)
#define COMP                ((COMP_Module *) COMP_BASE)
#define IWDG                ((IWDG_Module *) IWDG_BASE)
#define SPI                 ((SPI_Module *) SPI_BASE)
#define UART1               ((UART_Module *) UART1_BASE)
#define UART2               ((UART_Module *) UART2_BASE)
#define I2C                 ((I2C_Module *) I2C_BASE)
#define PWR                 ((PWR_Module *) PWR_BASE)

#define AFIO                ((AFIO_Module *) AFIO_BASE)
#define EXTI                ((EXTI_Module *) EXTI_BASE)
#define GPIOA               ((GPIO_Module *) GPIOA_BASE)
#define GPIOB               ((GPIO_Module *) GPIOB_BASE)
#define ADC                 ((ADC_Module *) ADC_BASE)
#define RCC                 ((RCC_Module *) RCC_BASE)
#define FLASH               ((FLASH_Module *) FLASH_R_BASE)
#define OBT                 ((OB_Module *) OB_BASE)
#define CRC                 ((CRC_Module *) CRC_BASE)



/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/*** CRC calculation unit ***/
/** Bit definition for CRC_CRC16CTRL register **/
#define CRC16_CTRL_ENDHL    ((uint8_t)0x02)
#define CRC16_CTRL_LITTLE   ((uint8_t)0x02)
#define CRC16_CTRL_BIG      ((uint8_t)0xFD)

#define CRC16_CTRL_CLR      ((uint8_t)0x04)
#define CRC16_CTRL_RESET    ((uint8_t)0x04)
#define CRC16_CTRL_NO_RESET ((uint8_t)0xFB)

/** Bit definition for CRC_CRC16DAT register **/
#define CRC16_CRC16DAT ((uint8_t)0xFF)

/** Bit definition for CRC_CRC16D register **/
#define CRC16_CRC16D ((uint16_t)0xFFFF)

/** Bit definition for CRC_LRC register **/
#define CRC_LRC_LRCDAT ((uint8_t)0xFF)


/*** Power Control ***/
/** Bit definition for PWR_CTRL register **/
#define PWR_CTRL_IWDGRSTEN ((uint16_t)0x0001) /* IWDG reset request causes a system reset */
#define PWR_CTRL_PDSTP     ((uint16_t)0x0002) /* 0: CPU output DEEPSLEEP is 1, and the chip enters STOP mode,*/
												 /*1: CPU output DEEPSLEEP is 1, and the chip enters PD mode */
#define PWR_CTRL_CLRWKUPF  ((uint16_t)0x0004) /* Clear Wakeup Flag */
#define PWR_CTRL_CLRDBGPDF ((uint16_t)0x0008) /* Clear DBGPDF flag */
#define PWR_CTRL_PVDEN     ((uint16_t)0x0010) /* PVD Enables control */

#define PWR_CTRL_PLS       ((uint16_t)0x01E0) /* PLS[3:0] bits (PVD Level Selection) */
#define PWR_CTRL_PLS_0     ((uint16_t)0x0020) /* Bit 0 */
#define PWR_CTRL_PLS_1     ((uint16_t)0x0040) /* Bit 1 */
#define PWR_CTRL_PLS_2     ((uint16_t)0x0080) /* Bit 2 */
#define PWR_CTRL_PLS_3     ((uint16_t)0x0100) /* Bit 3 */

#define PWR_CTRL_PDRS      ((uint16_t)0x0600) /* PDRS[2:0] bits (VDDD PDR trigger level in STOP mode) */
#define PWR_CTRL_PDRS_0    ((uint16_t)0x0200) /* Bit 0 */
#define PWR_CTRL_PDRS_1    ((uint16_t)0x0400) /* Bit 1 */

#define PWR_CTRL_NRSTPOL   ((uint16_t)0x0800) /* NRST polarity selection */

#define PWR_CTRL_PVDCNT    ((uint32_t)0x01FE0000) /* PVD count */
#define PWR_CTRL_PVDFILEN  ((uint32_t)0x02000000) /* Enable PVD filter */
#define PWR_CTRL_PVDITEN   ((uint32_t)0x04000000) /* Enable PVD interrupt */

/** Bit definition for PWR_CTRLSTS register **/
#define PWR_CTRLSTS_WKUPF   ((uint16_t)0x0001) /* Wakeup Flag */
#define PWR_CTRLSTS_DBGPDF  ((uint16_t)0x0002) /* DBGPDF Flag */
#define PWR_CTRLSTS_PVDO    ((uint16_t)0x0004) /* PVD Output */
#define PWR_CTRLSTS_WKUP0EN ((uint16_t)0x0100) /* Enable WKUP pin PA1 */
#define PWR_CTRLSTS_WKUP1EN ((uint16_t)0x0200) /* Enable WKUP pin PA2 */
#define PWR_CTRLSTS_WKUPPOL ((uint16_t)0x0400) /* Polarity of WKUP pin PA1/PA2,0:Falling edge,1:Rising edge */

/** Bit definition for PWR_CTRL2 register **/
#define PWR_CTRL2_LVRCNT   ((uint16_t)0x00FF) /* LVR filter control counts */
#define PWR_CTRL2_LVRFILEN ((uint16_t)0x0100) /* Enable LVR filter */
#define PWR_CTRL2_LVRRSTEN ((uint16_t)0x0200) /* Enable LVR reset */
#define PWR_CTRL2_LVREN    ((uint16_t)0x0400) /* Enable LVR */

#define PWR_CTRL2_LVRLS    ((uint16_t)0x7800) /* LVRLS[3:0] bits (LVR Level Selection) */
#define PWR_CTRL2_LVRLS_0  ((uint16_t)0x0800) /* Bit 0 */
#define PWR_CTRL2_LVRLS_1  ((uint16_t)0x1000) /* Bit 1 */
#define PWR_CTRL2_LVRLS_2  ((uint16_t)0x2000) /* Bit 2 */
#define PWR_CTRL2_LVRLS_3  ((uint16_t)0x4000) /* Bit 3 */

#define PWR_CTRL2_LVRO     ((uint16_t)0x8000) /* LVR Output */

#define PWR_CTRL2_LVRKEY   ((uint32_t)0xFF000000) /* LVR key */

/** Bit definition for PWR_CTRL3 register **/
#define PWR_CTRL3_MRPWR     ((uint16_t)0x0001) /* MR is controlled by PWR */
#define PWR_CTRL3_LPMRPWR   ((uint16_t)0x0002) /* MR low power is controlled by PWR */
#define PWR_CTRL3_SLPFLHPWR ((uint16_t)0x0004) /* Flash sleep is controlled by PWR */
#define PWR_CTRL3_PDFLHPWR  ((uint16_t)0x0008) /* Flash power down is controlled by PWR */
#define PWR_CTRL3_HSIPWR    ((uint16_t)0x0020) /* HSI is controlled by PWR */
#define PWR_CTRL3_HSISEL    ((uint16_t)0x0040) /* HSI frequency selection, 0: 48M, 1: 40M */
#define PWR_CTRL3_LSIEN     ((uint16_t)0x0080) /* Control PWR Enables the LSI */
#define PWR_CTRL3_PDRSEL    ((uint16_t)0x0200) /* VDDD PDR select signal is controlled by PWR */
#define PWR_CTRL3_LSISTPCNT ((uint16_t)0x1C00) /* LSI stop count */

/** Bit definition for PWR_CTRL4 register **/
#define PWR_CTRL4_FLHWKUP ((uint16_t)0x0001) /* Flash quick Wake up */
#define PWR_CTRL4_STBFLH  ((uint16_t)0x0002) /* Flash Deep standby mode */
#define PWR_CTRL4_RUNF    ((uint16_t)0x0004) /* System in RUN mode */

/** Bit definition for PWR_CTRL5 register **/
#define PWR_CTRL5_STPMRSEL   ((uint16_t)0x000C) /* STPMRSEL[1:0] bits (After enter STOP mode, VDDD output voltage select) */
#define PWR_CTRL5_STPMRSEL_0 ((uint16_t)0x0004) /* Bit 0 */
#define PWR_CTRL5_STPMRSEL_1 ((uint16_t)0x0008) /* Bit 1 */

