ljgabc/rtthread/bsp/n32g003/library/n32g003.h
/** Bit definition for PWR_CTRL6 register **/
#define PWR_CTRL6_STPMREN   ((uint16_t)0x000C) /* STPMREN[1:0] bits (After enter STOP mode, Enable VDDD output voltage select) */
#define PWR_CTRL6_STPMREN_0 ((uint16_t)0x0004) /* Bit 0 */
#define PWR_CTRL6_STPMREN_1 ((uint16_t)0x0008) /* Bit 1 */

/** Bit definition for DBG_CTRL register **/
#define DBG_CTRL_STOP    ((uint16_t)0x0002) /* Debug STOP mode control */
#define DBG_CTRL_PD      ((uint16_t)0x0004) /* Debug PD mode control */
#define DBG_CTRL_IWDGSTP ((uint16_t)0x0020) /* Debug LWDG mode control */
#define DBG_CTRL_TIM1STP ((uint16_t)0x0040) /* Debug TIM1 mode control */
#define DBG_CTRL_TIM3STP ((uint16_t)0x0080) /* Debug TIM3 mode control */
#define DBG_CTRL_TIM6STP ((uint16_t)0x0100) /* Debug TIM6 mode control */


/*** Reset and Clock Control ***/

/** Bit definition for RCC_HSICTRL register **/
#define  RCC_HSICTRL_HSI40MRDF                    ((uint32_t)0x00000001)        /* Internal High Speed clock 40M ready flag */
#define  RCC_HSICTRL_HSI48MRDF                    ((uint32_t)0x00000002)        /* Internal High Speed clock 48M ready flag */
#define  RCC_HSICTRL_HSITRIM                      ((uint32_t)0x000000F0)        /* Internal High Speed clock trimming */

/** Bit definition for RCC_CFG register **/

/** AHBPRES configuration */
#define RCC_CFG_AHBPRES       ((uint32_t)0x000000F0) /* AHBPRES[3:0] bits (AHB prescaler) */
#define RCC_CFG_AHBPRES_0     ((uint32_t)0x00000010) /* Bit 0 */
#define RCC_CFG_AHBPRES_1     ((uint32_t)0x00000020) /* Bit 1 */
#define RCC_CFG_AHBPRES_2     ((uint32_t)0x00000040) /* Bit 2 */
#define RCC_CFG_AHBPRES_3     ((uint32_t)0x00000080) /* Bit 3 */

#define RCC_CFG_AHBPRES_DIV1   ((uint32_t)0x00000000) /* SYSCLK not divided */
#define RCC_CFG_AHBPRES_DIV2   ((uint32_t)0x00000080) /* SYSCLK divided by 2 */
#define RCC_CFG_AHBPRES_DIV4   ((uint32_t)0x00000090) /* SYSCLK divided by 4 */
#define RCC_CFG_AHBPRES_DIV8   ((uint32_t)0x000000A0) /* SYSCLK divided by 8 */
#define RCC_CFG_AHBPRES_DIV12  ((uint32_t)0x000000B0) /* SYSCLK divided by 12 */
#define RCC_CFG_AHBPRES_DIV16  ((uint32_t)0x000000C0) /* SYSCLK divided by 16 */
#define RCC_CFG_AHBPRES_DIV24  ((uint32_t)0x000000D0) /* SYSCLK divided by 24 */

/** PPRE configuration **/
/** APBPRES configuration */
#define RCC_CFG_APBPRES       ((uint32_t)0x00000700) /* APB1PRES[2:0] bits (APB1 prescaler) */
#define RCC_CFG_APBPRES_0	    ((uint32_t)0x00000100) /* Bit 0 */
#define RCC_CFG_APBPRES_1     ((uint32_t)0x00000200) /* Bit 1 */
#define RCC_CFG_APBPRES_2     ((uint32_t)0x00000400) /* Bit 2 */

#define RCC_CFG_APBPRES_DIV1  ((uint32_t)0x00000000) /* HCLK not divided */
#define RCC_CFG_APBPRES_DIV2  ((uint32_t)0x00000400) /* HCLK divided by 2 */
#define RCC_CFG_APBPRES_DIV4  ((uint32_t)0x00000500) /* HCLK divided by 4 */
#define RCC_CFG_APBPRES_DIV8  ((uint32_t)0x00000600) /* HCLK divided by 8 */
#define RCC_CFG_APBPRES_DIV16 ((uint32_t)0x00000700) /* HCLK divided by 16 */

/** SYSPRES configuration **/
#define  RCC_CFG_SYSPRES                      ((uint32_t)0x00003000)        /* PRE1[2:0] bits (SYSCLk prescaler) */
#define  RCC_CFG_SYSPRES_0                    ((uint32_t)0x00001000)        /* Bit 0 */
#define  RCC_CFG_SYSPRES_1                    ((uint32_t)0x00002000)        /* Bit 1 */

#define  RCC_CFG_SYSPRES_DIV1                ((uint32_t)0x00000000)        /* HSICLK not divided */
#define  RCC_CFG_SYSPRES_DIV2                ((uint32_t)0x00001000)        /* HSICLK divided by 2 */
#define  RCC_CFG_SYSPRES_DIV5                ((uint32_t)0x00003000)        /* HSICLK divided by 5 */
#define  RCC_CFG_SYSPRES_DIV6                ((uint32_t)0x00003000)        /* HSICLK divided by 6 */


/** MCO configuration **/
#define RCC_CFG_MCO  	   									  ((uint32_t)0x06000000) /* MCO[1:0] bits (Microcontroller Clock Output) */
#define RCC_CFG_MCO_0	  							      ((uint32_t)0x02000000) /* Bit 0 */
#define RCC_CFG_MCO_1	                      ((uint32_t)0x04000000) /* Bit 1 */

#define RCC_CFG_MCO_NOCLK					  	      ((uint32_t)0x00000000) /* No clock */
#define RCC_CFG_MCO_LSI	  							    ((uint32_t)0x02000000) /* LSI clock  selected as MCO source */
#define RCC_CFG_MCO_HSI	                    ((uint32_t)0x04000000) /* HSI clock selected as MCO source */

/** MCOPRE configuration **/
#define  RCC_CFG_MCOPRES                  ((uint32_t)0xF0000000)/* MCOPRE[3:0] bits ( Microcontroller Clock Output prescaler.) */
#define  RCC_CFG_MCOPRES_0                 ((uint32_t)0x10000000) /* Bit 0 */
#define  RCC_CFG_MCOPRES_1                 ((uint32_t)0x20000000) /* Bit 1 */
#define  RCC_CFG_MCOPRES_2                 ((uint32_t)0x40000000) /* Bit 2 */
#define  RCC_CFG_MCOPRES_3                 ((uint32_t)0x80000000) /* Bit 3 */

#define  RCC_CFG_MCOPRES_DIV1             ((uint32_t)0x00000000) /* LSI clock is divided by 1,HSI clock is divided by 2 */
#define  RCC_CFG_MCOPRES_DIV2             ((uint32_t)0x10000000) /* LSI/HSI clock is divided by 2 */
#define  RCC_CFG_MCOPRES_DIV3             ((uint32_t)0x20000000) /* LSI/HSI clock is divided by 3 */
#define  RCC_CFG_MCOPRES_DIV4             ((uint32_t)0x30000000) /* LSI/HSI clock is divided by 4 */
#define  RCC_CFG_MCOPRES_DIV5             ((uint32_t)0x40000000) /* LSI/HSI clock is divided by 5 */
#define  RCC_CFG_MCOPRES_DIV6             ((uint32_t)0x50000000) /* LSI/HSI clock is divided by 6 */
#define  RCC_CFG_MCOPRES_DIV7             ((uint32_t)0x60000000) /* LSI/HSI clock is divided by 7 */
#define  RCC_CFG_MCOPRES_DIV8             ((uint32_t)0x70000000) /* LSI/HSI clock is divided by 8 */
#define  RCC_CFG_MCOPRES_DIV9             ((uint32_t)0x80000000) /* LSI/HSI clock is divided by 9 */
#define  RCC_CFG_MCOPRES_DIV10            ((uint32_t)0x90000000) /* LSI/HSI clock is divided by 10 */
#define  RCC_CFG_MCOPRES_DIV11            ((uint32_t)0xA0000000) /* LSI/HSI clock is divided by 11 */
#define  RCC_CFG_MCOPRES_DIV12            ((uint32_t)0xB0000000) /* LSI/HSI clock is divided by 12 */
#define  RCC_CFG_MCOPRES_DIV13            ((uint32_t)0xC0000000) /* LSI/HSI clock is divided by 13 */
#define  RCC_CFG_MCOPRES_DIV14            ((uint32_t)0xD0000000) /* LSI/HSI clock is divided by 14 */
#define  RCC_CFG_MCOPRES_DIV15            ((uint32_t)0xE0000000) /* LSI/HSI clock is divided by 15 */
#define  RCC_CFG_MCOPRES_DIV32            ((uint32_t)0xF0000000) /* LSI/HSI clock is divided by 32 */

