ljgabc/rtthread/bsp/n32g003/library/n32g003.h
/**  Bit definition for RCC_PRST register  **/
#define RCC_PRST_AFIORST    ((uint32_t)0x00000001) /* Alternate Function I/O reset */
#define RCC_PRST_BEEPRST    ((uint32_t)0x00000002) /* Beeper reset */
#define RCC_PRST_GPIOARST   ((uint32_t)0x00000004) /* GPIOA reset */
#define RCC_PRST_GPIOBRST   ((uint32_t)0x00000008) /* GPIOB reset */
#define RCC_PRST_UART1RST   ((uint32_t)0x00000010) /* UART 1 reset */
#define RCC_PRST_UART2RST   ((uint32_t)0x00000020) /* UART 2 reset */
#define RCC_PRST_I2CRST     ((uint32_t)0x00000040) /* I2C reset */
#define RCC_PRST_PWRRST     ((uint32_t)0x00000080) /* Power interface reset */
#define RCC_PRST_ADCRST     ((uint32_t)0x00000100) /* ADC reset */
#define RCC_PRST_SPIRST     ((uint32_t)0x00000400) /* SPI reset */
#define RCC_PRST_TIM1RST    ((uint32_t)0x00000800) /* Timer 1 reset */
#define RCC_PRST_TIM3RST    ((uint32_t)0x00001000) /* Timer 3 reset */
#define RCC_PRST_TIM6RST    ((uint32_t)0x00002000) /* Timer 6 reset */
#define RCC_PRST_COMPRST    ((uint32_t)0x00004000) /* COMP reset */


/** Bit definition for RCC_AHBPCLKEN register **/
#define RCC_AHBPCLKEN_CRCEN    ((uint32_t)0x00000040) /* CRC clock enable */
#define RCC_AHBPCLKEN_ADCEN    ((uint32_t)0x00001000) /* ADC clock enable */

/** Bit definition for RCC_APBPCLKEN register **/
#define RCC_APBPCLKEN_AFIOEN  			 ((uint32_t)0x00000001) /* Alternate Function I/O enable */
#define RCC_APBPCLKEN_BEEPEREN   		 ((uint32_t)0x00000002) /* Beeper enable */
#define RCC_APBPCLKEN_IOPAEN         ((uint32_t)0x00000004) /* I/O port A clock enable */
#define RCC_APBPCLKEN_IOPBEN         ((uint32_t)0x00000008) /* I/O port B clock enable */
#define RCC_APBPCLKEN_COMPEN         ((uint32_t)0x00000010) /* COMP enable */
#define RCC_APBPCLKEN_COMPFILTEN     ((uint32_t)0x00000020) /* COMPFILT enable */
#define RCC_APBPCLKEN_UART1EN        ((uint32_t)0x00000040) /* UART 1 enable */
#define RCC_APBPCLKEN_UART2EN        ((uint32_t)0x00000080) /* UART 2 enable */
#define RCC_APBPCLKEN_I2CEN          ((uint32_t)0x00000100) /* I2C  enable */
#define RCC_APBPCLKEN_PWREN          ((uint32_t)0x00000200) /* Power enable */
#define RCC_APBPCLKEN_SPIEN          ((uint32_t)0x00000400) /* SPI  enable */
#define RCC_APBPCLKEN_TIM1EN         ((uint32_t)0x00000800) /* Timer 1 enable */
#define RCC_APBPCLKEN_TIM3EN         ((uint32_t)0x00001000) /* Timer 3 enable */
#define RCC_APBPCLKEN_TIM6EN         ((uint32_t)0x00002000) /* Timer 6 enable */
#define RCC_APBPCLKEN_IWDGEN         ((uint32_t)0x00004000) /* Independent Watchdog enable */

/**  Bit definition for RCC_LSICTRL register  **/
#define  RCC_LSICTRL_LSIRDF          ((uint32_t)0x00000002)        /* Internal Low Speed clock ready flag */
#define  RCC_LSICTRL_LSITRIM         ((uint32_t)0x0000007C)        /* Internal Low Speed clock trimming */
#define  RCC_LSICTRL_LSIDETEN        ((uint32_t)0x00000080)        /* Internal Low Speed clock detect enable */
#define  RCC_LSICTRL_LSIFREQ         ((uint32_t)0x00FFFF00)        /* Internal Low Speed clock freq cnt */
#define  RCC_LSICTRL_LSIDETFF        ((uint32_t)0x01000000)        /* Internal Low Speed clock detect finish flag */

/** Bit definition for RCC_CTRLSTS register **/
#define RCC_CTRLSTS_RMRSTF          ((uint32_t)0x00000001) /* Remove reset flag */
#define RCC_CTRLSTS_PINRSTF         ((uint32_t)0x00000008) /* PIN reset flag */
#define RCC_CTRLSTS_PORRSTF         ((uint32_t)0x00000010) /* POR/PDR reset flag */
#define RCC_CTRLSTS_SFTRSTF         ((uint32_t)0x00000020) /* Software Reset flag */
#define RCC_CTRLSTS_IWDGRSTF        ((uint32_t)0x00000040) /* Independent Watchdog reset flag */
#define RCC_CTRLSTS_LVRRSTF         ((uint32_t)0x00000080) /* LVR reset flag */
#define RCC_CTRLSTS_LPWRRSTF        ((uint32_t)0x00000100) /* Low-Power reset flag */
#define RCC_CTRLSTS_EMCRSTF         ((uint32_t)0x00000800) /* EMC reset flag */

/** Bit definition for RCC_CFG2 register **/
/** ADCPRES configuration **/
#define RCC_CFG2_ADCPRES  				 ((uint32_t)0x0000000F) /* ADCHSIPRE[3:0] bits */
#define RCC_CFG2_ADCPRES_0 			   ((uint32_t)0x00000001) /* Bit 0 */
#define RCC_CFG2_ADCPRES_1				 ((uint32_t)0x00000002) /* Bit 1 */
#define RCC_CFG2_ADCPRES_2 			   ((uint32_t)0x00000004) /* Bit 2 */
#define RCC_CFG2_ADCPRES_3				 ((uint32_t)0x00000008) /* Bit 3 */

#define RCC_CFG2_ADCPRES_DIV1      ((uint32_t)0x00000000) /* HCLK clock divided by 1 */
#define RCC_CFG2_ADCPRES_DIV2      ((uint32_t)0x00000001) /* HCLK clock divided by 2 */
#define RCC_CFG2_ADCPRES_DIV3      ((uint32_t)0x00000002) /* HCLK clock divided by 3 */
#define RCC_CFG2_ADCPRES_DIV4      ((uint32_t)0x00000003) /* HCLK clock divided by 4 */
#define RCC_CFG2_ADCPRES_DIV6      ((uint32_t)0x00000004) /* HCLK clock divided by 6 */
#define RCC_CFG2_ADCPRES_DIV8      ((uint32_t)0x00000005) /* HCLK clock divided by 8 */
#define RCC_CFG2_ADCPRES_DIV10     ((uint32_t)0x00000006) /* HCLK clock divided by 10 */
#define RCC_CFG2_ADCPRES_DIV12     ((uint32_t)0x00000007) /* HCLK clock divided by 12 */
#define RCC_CFG2_ADCPRES_DIV24     ((uint32_t)0x00000008  /* HCLK clock divided by 24 */
#define RCC_CFG2_ADCPRES_DIV32     ((uint32_t)0x00000009) /* HCLK clock divided by 32 */
#define RCC_CFG2_ADCPRES_OTHERS    ((uint32_t)0x0000000A) /* HCLK clock divided by 32 */

/** ADC1MSEL configuration **/
#define RCC_CFG2_ADCCLK_SEL     		((uint32_t)0x00000010) /* ADC1M clock source select */
#define RCC_CFG2_ADCCLK_SEL_HSI 		((uint32_t)0x00000000) /* HSI clock selected as ADC1M input clock */
#define RCC_CFG2_ADCCLK_SEL_IOM 		((uint32_t)0x00000010) /* IOM test clock selected as ADC1M input clock */

/** ADC1MPRES configuration **/
#define RCC_CFG2_ADC1MPRES   				((uint32_t)0x00000C00) /* ADC1MPRE[4:0] bits */
#define RCC_CFG2_ADC1MPRES_0 				((uint32_t)0x00000400) /* Bit 0 */
#define RCC_CFG2_ADC1MPRES_1 				((uint32_t)0x00000800) /* Bit 1 */

#define RCC_CFG2_ADC1MPRES_DIV6   		((uint32_t)0x00000000) /* ADC1M source clock is divided by 6 */
#define RCC_CFG2_ADC1MPRES_DIV12 		  ((uint32_t)0x00000400) /* ADC1M source clock is divided by 12 */
#define RCC_CFG2_ADC1MPRES_DIV24  		((uint32_t)0x00000800) /* ADC1M source clock is divided by 24 */
#define RCC_CFG2_ADC1MPRES_DIV40 	    ((uint32_t)0x00000C00) /* ADC1M source clock is divided by 40 */
#define RCC_CFG2_ADC1MPRES_DIV48 	    ((uint32_t)0x00000C00) /* ADC1M source clock is divided by 48 */

/** TIM6CLKSEL  configuration **/
#define RCC_CFG2_TIM6CLKSEL         ((uint32_t)0x40000000) /* Timer6 clock source select */
#define RCC_CFG2_TIM6CLKSEL_PCLK    ((uint32_t)0x00000000) /* Timer6 clock selected as APB input clock */
#define RCC_CFG2_TIM6CLKSEL_LSI     ((uint32_t)0x40000000) /* Timer6 clock selected as LSI clock */

/** TIM1CLKSEL  configuration **/
#define RCC_CFG2_TIM1CLKSEL        	   ((uint32_t)0x80000000) /* Timer1 clock source select */
#define RCC_CFG2_TIM1CLKSEL_PCLK        ((uint32_t)0x00000000) /* Timer1 clock selected as APB input clock */
#define RCC_CFG2_TIM1CLKSEL_SYSCLK      ((uint32_t)0x80000000) /* Timer1 clock selected as System clock */

/**  Bit definition for RCC_EMCCTRL register  **/
#define  RCC_EMCCTRL_EMCDETEN                    ((uint32_t)0x00000001) /* EMC Clamp reset enable */
#define  RCC_EMCCTRL_EMCRSTEN                    ((uint32_t)0x00001000) /* EMC Clamp detect enable */

/*** General Purpose and Alternate Function I/O ***/

/** Bit definition for GPIO_PMODE register **/
#define GPIO_PMODE0_Pos            (0)                                   
#define GPIO_PMODE0_Msk            (0x3 << GPIO_PMODE0_Pos)         /* 0x00000003 */ 
#define GPIO_PMODE0                        GPIO_PMODE0_Msk          /* 0x00000003 */
#define GPIO_PMODE0_0              (0x0 << GPIO_PMODE0_Pos)         /* 0x00000000 */
#define GPIO_PMODE0_1              (0x1 << GPIO_PMODE0_Pos)         /* 0x00000001 */
#define GPIO_PMODE0_2              (0x2 << GPIO_PMODE0_Pos)         /* 0x00000002 */
#define GPIO_PMODE0_3              (0x3 << GPIO_PMODE0_Pos)         /* 0x00000003 */

#define GPIO_PMODE1_Pos            (2)                                   
#define GPIO_PMODE1_Msk            (0x3 << GPIO_PMODE1_Pos)         /* 0x0000000C */
#define GPIO_PMODE1                        GPIO_PMODE1_Msk          /* 0x0000000C */
#define GPIO_PMODE1_0              (0x0 << GPIO_PMODE1_Pos)         /* 0x00000000 */
#define GPIO_PMODE1_1              (0x1 << GPIO_PMODE1_Pos)         /* 0x00000004 */
#define GPIO_PMODE1_2              (0x2 << GPIO_PMODE1_Pos)         /* 0x00000008 */
#define GPIO_PMODE1_3              (0x3 << GPIO_PMODE1_Pos)         /* 0x0000000C */

#define GPIO_PMODE2_Pos            (4)                                   
#define GPIO_PMODE2_Msk            (0x3 << GPIO_PMODE2_Pos)         /* 0x00000030 */               
#define GPIO_PMODE2                        GPIO_PMODE2_Msk          /* 0x00000030 */
#define GPIO_PMODE2_0              (0x0 << GPIO_PMODE2_Pos)         /* 0x00000000 */
#define GPIO_PMODE2_1              (0x1 << GPIO_PMODE2_Pos)         /* 0x00000010 */
#define GPIO_PMODE2_2              (0x2 << GPIO_PMODE2_Pos)         /* 0x00000020 */
#define GPIO_PMODE2_3              (0x3 << GPIO_PMODE2_Pos)         /* 0x00000030 */

#define GPIO_PMODE3_Pos            (6)                                   
#define GPIO_PMODE3_Msk            (0x3 << GPIO_PMODE3_Pos)         /* 0x000000C0 */
#define GPIO_PMODE3                        GPIO_PMODE3_Msk          /* 0x000000C0 */
#define GPIO_PMODE3_0              (0x0 << GPIO_PMODE3_Pos)         /* 0x00000000 */
#define GPIO_PMODE3_1              (0x1 << GPIO_PMODE3_Pos)         /* 0x00000040 */
#define GPIO_PMODE3_2              (0x2 << GPIO_PMODE3_Pos)         /* 0x00000080 */
#define GPIO_PMODE3_3              (0x3 << GPIO_PMODE3_Pos)         /* 0x000000C0 */

