ljgabc/rtthread/bsp/n32g003/library/n32g003.h
/** Bit definition for EXTI_PEND register **/
#define EXTI_PEND_PEND0        ((uint32_t)0x00000001) /* Pending bit for line 0 */
#define EXTI_PEND_PEND1        ((uint32_t)0x00000002) /* Pending bit for line 1 */
#define EXTI_PEND_PEND2        ((uint32_t)0x00000004) /* Pending bit for line 2 */
#define EXTI_PEND_PEND3        ((uint32_t)0x00000008) /* Pending bit for line 3 */
#define EXTI_PEND_PEND4        ((uint32_t)0x00000010) /* Pending bit for line 4 */
#define EXTI_PEND_PEND5        ((uint32_t)0x00000020) /* Pending bit for line 5 */
#define EXTI_PEND_PEND6        ((uint32_t)0x00000040) /* Pending bit for line 6 */
#define EXTI_PEND_PEND7        ((uint32_t)0x00000080) /* Pending bit for line 7 */
#define EXTI_PEND_PEND8        ((uint32_t)0x00000100) /* Pending bit for line 8 */
#define EXTI_PEND_PEND9        ((uint32_t)0x00000200) /* Pending bit for line 9 */
#define EXTI_PEND_PEND10       ((uint32_t)0x00000400) /* Pending bit for line 10 */
#define EXTI_PEND_PEND11       ((uint32_t)0x00000800) /* Pending bit for line 11 */
#define EXTI_PEND_PEND12       ((uint32_t)0x00001000) /* Pending bit for line 12 */
#define EXTI_PEND_PEND13       ((uint32_t)0x00002000) /* Pending bit for line 13 */
#define EXTI_PEND_PEND14       ((uint32_t)0x00004000) /* Pending bit for line 14 */
#define EXTI_PEND_PEND15       ((uint32_t)0x00008000) /* Pending bit for line 15 */
#define EXTI_PEND_PEND16       ((uint32_t)0x00010000) /* Pending bit for line 16 */
#define EXTI_PEND_PEND17       ((uint32_t)0x00020000) /* Pending bit for line 17 */
#define EXTI_PEND_PEND18       ((uint32_t)0x00040000) /* Pending bit for line 18 */
#define EXTI_PEND_PEND19       ((uint32_t)0x00080000) /* Pending bit for line 19 */



//*** Analog to Digital Converter ***/

/** Bit definition for ADC_STS register **/
#define ADC_STS_AWDG     					((uint8_t)0x01) /* Analog watchdog flag */
#define ADC_STS_ENDC     					((uint8_t)0x02) /* End of conversion */
#define ADC_STS_STR      					((uint8_t)0x04) /* Regular channel Start flag */
#define ADC_STS_ENDCA    					((uint8_t)0x08) /* Regular channel any end flag */

/** Bit definition for ADC_CTRL1 register **/
#define ADC_CTRL1_AWDGCH					((uint32_t)0x0000001F) /* AWDG_CH[3:0] bits (Analog watchdog channel select bits) */
#define ADC_CTRL1_AWDGCH_0 					((uint32_t)0x00000001) /* Bit 0 */
#define ADC_CTRL1_AWDGCH_1 					((uint32_t)0x00000002) /* Bit 1 */
#define ADC_CTRL1_AWDGCH_2 					((uint32_t)0x00000004) /* Bit 2 */
#define ADC_CTRL1_AWDGCH_3 					((uint32_t)0x00000008) /* Bit 3 */

#define ADC_CTRL1_ENDCIEN   				((uint32_t)0x00000010) /* Interrupt enable for EOC */
#define ADC_CTRL1_AWDGIEN   				((uint32_t)0x00000020) /* Analog Watchdog interrupt enable */
#define ADC_CTRL1_AWDGSGLEN 				((uint32_t)0x00000040) /* Enable the watchdog on a single channel in scan mode */
#define ADC_CTRL1_AWDGERCH 					((uint32_t)0x00000080) /* Analog watchdog enable on regular channels */

/** Bit definition for ADC_CTRL2 register **/
#define ADC_CTRL2_ON    					((uint32_t)0x00000001) /* A/D Converter ON / OFF */
#define ADC_CTRL2_CTU   					((uint32_t)0x00000002) /* Continuous Conversion */
#define ADC_CTRL2_ALIG  					((uint32_t)0x00000040) /* Data Alignment */

#define ADC_CTRL2_EXTRSEL   				((uint32_t)0x00000078) /* EXTSEL[3:0] bits (External Event Select for regular group) */
#define ADC_CTRL2_EXTRSEL_0 				((uint32_t)0x00000080) /* Bit 0 */
#define ADC_CTRL2_EXTRSEL_1 				((uint32_t)0x00000010) /* Bit 1 */
#define ADC_CTRL2_EXTRSEL_2 				((uint32_t)0x00080020) /* Bit 2 */
#define ADC_CTRL2_EXTRSEL_3 				((uint32_t)0x00080040) /* Bit 3 */

#define ADC_CTRL2_EXTRTRIG 					((uint32_t)0x00000080) /* External Trigger Conversion mode for regular channels */
#define ADC_CTRL2_SWSTRRCH 					((uint32_t)0x00000100) /* Start Conversion of regular channels */

#define ADC_CTRL2_LEN 						((uint32_t)0x00000E00) /* LEN[2:0] bits (Regular Sequence length) */
#define ADC_CTRL2_LEN_0 					((uint32_t)0x00000200) /* Bit 0 */
#define ADC_CTRL2_LEN_1 					((uint32_t)0x00000400) /* Bit 1 */
#define ADC_CTRL2_LEN_2 					((uint32_t)0x00000800) /* Bit 2 */

#define ADC_CTRL2_SCANMD    				((uint32_t)0x00001000) /* Scan mode */

/** Bit definition for ADC_CTRL3 register **/
#define ADC_CTRL3_VREFEN     				((uint16_t)0x0002) /* ADC VREFINT_EN */
#define ADC_CTRL3_VREFRDY    				((uint16_t)0x0004) /* ADC VREFINT_READY */
#define ADC_CTRL3_RDY       				((uint16_t)0x0008) /* ADC Ready */
#define ADC_CTRL3_PDRDY      				((uint16_t)0x0010) /* ADC Power_down Ready */
#define ADC_CTRL3_ENDCAIEN   				((uint16_t)0x0020) /* Interrupt enable for any regular channels */

/** Bit definition for ADC_SAMPT register **/
#define  ADC_SAMPT_SAMP                     ((uint32_t)0x00000001F) /* SMP10[4:0] bits (Channel Sample time selection) */
#define  ADC_SAMPT_SAMP_0                   ((uint32_t)0x00000001)  /* Bit 0 */
#define  ADC_SAMPT_SAMP_1                   ((uint32_t)0x00000002)  /* Bit 1 */
#define  ADC_SAMPT_SAMP_2                   ((uint32_t)0x00000004)  /* Bit 2 */
#define  ADC_SAMPT_SAMP_3                   ((uint32_t)0x00000008)  /* Bit 3 */
#define  ADC_SAMPT_SAMP_4                   ((uint32_t)0x00000010)  /* Bit 4 */

/** Bit definition for ADC_WDGHIGH register **/
#define ADC_WDGHIGH_HTH 					((uint16_t)0x0FFF)  /* Analog watchdog high threshold */

/** Bit definition for ADC_WDGLOW register **/
#define ADC_WDGLOW_LTH 						((uint16_t)0x0FFF)  /* Analog watchdog low threshold */

/** Bit definition for ADC_DATA0 register **/
#define ADC_DAT0_DAT     					((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT0_SEQ0     					((uint32_t)0x000F0000) /* channel seqence of conversion */
#define ADC_DAT0_SEQ0_0     				((uint32_t)0x00010000) /* Bit 0 */
#define ADC_DAT0_SEQ0_1     				((uint32_t)0x00020000) /* Bit 1 */
#define ADC_DAT0_SEQ0_2     				((uint32_t)0x00040000) /* Bit 2 */
#define ADC_DAT0_SEQ0_3     				((uint32_t)0x00080000) /* Bit 3 */

/** Bit definition for ADC_DATA1 register **/
#define ADC_DAT1_DAT     					((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT1_SEQ1     					((uint32_t)0x000F0000) /* channel seqence of conversion */
#define ADC_DAT1_SEQ1_0     				((uint32_t)0x00010000) /* Bit 0 */
#define ADC_DAT1_SEQ1_1     				((uint32_t)0x00020000) /* Bit 1 */
#define ADC_DAT1_SEQ1_2     				((uint32_t)0x00040000) /* Bit 2 */
#define ADC_DAT1_SEQ1_3     				((uint32_t)0x00080000) /* Bit 3 */

/** Bit definition for ADC_DATA2 register **/
#define ADC_DAT2_DAT     					((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT2_SEQ2     					((uint32_t)0x000F0000) /* channel seqence of conversion */
#define ADC_DAT2_SEQ2_0     				((uint32_t)0x00010000) /* Bit 0 */
#define ADC_DAT2_SEQ2_1     				((uint32_t)0x00020000) /* Bit 1 */
#define ADC_DAT2_SEQ2_2     				((uint32_t)0x00040000) /* Bit 2 */
#define ADC_DAT2_SEQ2_3     				((uint32_t)0x00080000) /* Bit 3 */

/** Bit definition for ADC_DATA3 register **/
#define ADC_DAT3_DAT     					((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT3_SEQ3     					((uint32_t)0x000F0000) /* channel seqence of conversion */
#define ADC_DAT3_SEQ3_0     				((uint32_t)0x00010000) /* Bit 0 */
#define ADC_DAT3_SEQ3_1     				((uint32_t)0x00020000) /* Bit 1 */
#define ADC_DAT3_SEQ3_2     				((uint32_t)0x00040000) /* Bit 2 */
#define ADC_DAT3_SEQ3_3     				((uint32_t)0x00080000) /* Bit 3 */

/** Bit definition for ADC_DATA4 register **/
#define ADC_DAT4_DAT     					((uint32_t)0x0000FFFF) /* Regular data */
#define ADC_DAT4_SEQ4     					((uint32_t)0x000F0000) /* channel seqence of conversion */
#define ADC_DAT4_SEQ4_0     				((uint32_t)0x00010000) /* Bit 0 */
#define ADC_DAT4_SEQ4_1     				((uint32_t)0x00020000) /* Bit 1 */
#define ADC_DAT4_SEQ4_2     				((uint32_t)0x00040000) /* Bit 2 */
#define ADC_DAT4_SEQ4_3     				((uint32_t)0x00080000) /* Bit 3 */



