ljgabc/rtthread/bsp/n32g003/library/n32g003.h
#define  I2C_GFLTRCTRL_SCLAFENN ((uint16_t)0x2000) /* SCL analog gfilter enable */

/******************  Bit definition for I2C_BYTENUM register  *******************/
#define  I2C_BYTENUM_BYTENUM       ((uint16_t)0x3FFF)               /* Master receives bytes configuration */
#define  I2C_BYTENUM_RXFSEL        ((uint16_t)0x4000)               /* Receive end send condition selection */
#define  I2C_BYTENUM_BYTENUMEN     ((uint16_t)0x8000)               /* Master receive byte control enable */


/*** Universal Asynchronous Receiver Transmitter ***/
/** Bit definition for UART_STS register **/
#define UART_STS_PEF    ((uint16_t)0x0001) /* Parity Error */
#define UART_STS_FEF    ((uint16_t)0x0002) /* Framing Error */
#define UART_STS_NEF    ((uint16_t)0x0004) /* Noise Error Flag */
#define UART_STS_OREF   ((uint16_t)0x0008) /* OverRun Error */
#define UART_STS_IDLEF  ((uint16_t)0x0010) /* IDLE line detected */
#define UART_STS_RXDNE  ((uint16_t)0x0020) /* Read Data Register Not Empty */
#define UART_STS_TXC    ((uint16_t)0x0040) /* Transmission Complete */
#define UART_STS_TXDE   ((uint16_t)0x0080) /* Transmit Data Register Empty */

/** Bit definition for UART_DAT register **/
#define UART_DAT_DATV   ((uint16_t)0x01FF) /* Data value */

/** Bit definition for UART_BRCF register **/
#define UART_BRCF_DIV_Decimal ((uint16_t)0x000F) /* Fraction of UARTDIV */
#define UART_BRCF_DIV_Integer ((uint16_t)0xFFF0) /* Mantissa of UARTDIV */

/** Bit definition for UART_CTRL1 register **/
#define UART_CTRL1_SDBRK    ((uint16_t)0x0001) /* Send Break */
#define UART_CTRL1_RCVWU    ((uint16_t)0x0002) /* Receiver wakeup */
#define UART_CTRL1_RXEN     ((uint16_t)0x0004) /* Receiver Enable */
#define UART_CTRL1_TXEN     ((uint16_t)0x0008) /* Transmitter Enable */
#define UART_CTRL1_IDLEIEN  ((uint16_t)0x0010) /* IDLE Interrupt Enable */
#define UART_CTRL1_RXDNEIEN ((uint16_t)0x0020) /* RXNE Interrupt Enable */
#define UART_CTRL1_TXCIEN   ((uint16_t)0x0040) /* Transmission Complete Interrupt Enable */
#define UART_CTRL1_TXDEIEN  ((uint16_t)0x0080) /* PE Interrupt Enable */
#define UART_CTRL1_PEIEN    ((uint16_t)0x0100) /* PE Interrupt Enable */
#define UART_CTRL1_PSEL     ((uint16_t)0x0200) /* Parity Selection */
#define UART_CTRL1_PCEN     ((uint16_t)0x0400) /* Parity Control Enable */
#define UART_CTRL1_WUM      ((uint16_t)0x0800) /* Wakeup method */
#define UART_CTRL1_WL       ((uint16_t)0x1000) /* Word length */
#define UART_CTRL1_UEN      ((uint16_t)0x2000) /* UART Enable */

/** Bit definition for UART_CTRL2 register **/
#define UART_CTRL2_ADDR   ((uint16_t)0x000F) /* Address of the UART node */
#define UART_CTRL2_STPB   ((uint16_t)0x3000) /* STOP[1:0] bits (STOP bits) */
#define UART_CTRL2_STPB_0 ((uint16_t)0x1000) /* Bit 0 */
#define UART_CTRL2_STPB_1 ((uint16_t)0x2000) /* Bit 1 */

/** Bit definition for UART_CTRL3 register **/
#define UART_CTRL3_HDMEN  ((uint16_t)0x0008) /* Half-Duplex Selection */


/*** FLASH Registers ***/

/**  Bit definition for FLASH_AC register  **/
#define  FLASH_AC_LATENCY                   ((uint8_t)0x07)               /* LATENCY[2:0] bits (Latency) */
#define  FLASH_AC_LATENCY_0                 ((uint8_t)0x00)               /* Bit 0 = 0 */
#define  FLASH_AC_LATENCY_1                 ((uint8_t)0x01)               /* Bit 0 = 1 */
#define  FLASH_AC_LATENCY_2                 ((uint8_t)0x02)               /* Bit 0 = 0; Bit 1 = 1 */
#define  FLASH_AC_LATENCY_3                 ((uint8_t)0x03)               /* Bit 0 = 1; Bit 1 = 1 */

#define  FLASH_AC_PRFTBFEN                  ((uint8_t)0x10)               /* Prefetch Buffer Enable */
#define  FLASH_AC_PRFTBFSTS                 ((uint8_t)0x20)               /* Prefetch Buffer Status */

/**  Bit definition for FLASH_KEY register  **/
#define  FLASH_KEY_FKEY                    ((uint32_t)0xFFFFFFFF)        /* FPEC Key */

/**  Bit definition for FLASH_OPTKEY register  **/
#define  FLASH_OPTKEY_OPTKEY              ((uint32_t)0xFFFFFFFF)        /* Option Byte Key */

/**  Bit definition for FLASH_STS register  **/
#define  FLASH_STS_BUSY                       ((uint16_t)0x0001)               /* Busy */
#define  FLASH_STS_PGERR                      ((uint16_t)0x0004)               /* Programming Error */
#define  FLASH_STS_WRPERR                     ((uint16_t)0x0010)               /* Write Protection Error */
#define  FLASH_STS_EOP                        ((uint16_t)0x0020)               /* End of operation */
#define  FLASH_STS_SPRERR                     ((uint16_t)0x0100)               /* Spccial Pattern read ERROR */
#define  FLASH_STS_CFGERR                     ((uint16_t)0x0200)               /* Flash initial configuration error */

/**  Bit definition for FLASH_CTRL register  **/
#define  FLASH_CTRL_PG                         ((uint16_t)0x0001)            /* Programming */
#define  FLASH_CTRL_PER                        ((uint16_t)0x0002)            /* Page Erase */
#define  FLASH_CTRL_MER                        ((uint16_t)0x0004)            /* Mass Erase */
#define  FLASH_CTRL_OPTPG                      ((uint16_t)0x0010)            /* Option Byte Programming */
#define  FLASH_CTRL_OPTER                      ((uint16_t)0x0020)            /* Option Byte Erase */
#define  FLASH_CTRL_START                      ((uint16_t)0x0040)            /* Start */
#define  FLASH_CTRL_LOCK                       ((uint16_t)0x0080)            /* Lock */
#define  FLASH_CTRL_MMER                       ((uint16_t)0x0100)            /* Mass Erase flash and optionbytes*/
#define  FLASH_CTRL_OPTWRE                     ((uint16_t)0x0200)            /* Option Bytes Write Enable */
#define  FLASH_CTRL_ERRITE                     ((uint16_t)0x0400)            /* Error Interrupt Enable */
#define  FLASH_CTRL_EOPITE                     ((uint16_t)0x1000)            /* End of operation interrupt enable */

/**  Bit definition for FLASH_ADD register  **/
#define  FLASH_ADD_FADD                        ((uint32_t)0xFFFFFFFF)        /* Flash Address */

/**  Bit definition for FLASH_OB register  **/
#define  FLASH_OB_OBERR                      ((uint16_t)0x0001)            /* Option Byte Error */
#define  FLASH_OB_RDPRT1                     ((uint16_t)0x0002)            /* Read protection */

#define  FLASH_OB_USER                      ((uint16_t)0x007C)            /* User Option Bytes */
#define  FLASH_OB_WDG_SW                    ((uint16_t)0x0004)            /* WDG_SW */
#define  FLASH_OB_nRST_STOP                 ((uint16_t)0x0008)            /* nRST_STOP */
#define  FLASH_OB_nRST_PD                   ((uint16_t)0x0010)            /* nRST_STDBY */
#define  FLASH_OB_BOOT_LOCK                 ((uint16_t)0x0020)            /* BOOT_LOCK */
#define  FLASH_OB_NRST_PA0                  ((uint16_t)0x0040)            /* NRST_PA0 */

