ljgabc/rtthread/bsp/n32g003/library/n32g003.h
#define  FLASH_OB_DATA0_MSK                 ((uint32_t)0x0003FC00)        /* Data0 mask */
#define  FLASH_OB_DATA1_MSK                 ((uint32_t)0x03FC0000)        /* Data1 mask */
#define  FLASH_OB_RDPRT2                    ((uint32_t)0x80000000)        /* Read protection level 2 */

/**  Bit definition for FLASH_USER register  **/
#define  FLASH_USER_LVRCNT                  ((uint32_t)0x000000FF)       /* LVR filter control count value */
#define  FLASH_USER_LVRLS                   ((uint32_t)0x00000F00)       /* LVR gear selection */
#define  FLASH_USER_LVREN                   ((uint32_t)0x00001000)       /* LVR enable */
#define  FLASH_USER_LVRFILEN                ((uint32_t)0x00002000)       /* LVR filter enable */
#define  FLASH_USER_LVRRSTEN                ((uint32_t)0x00001000)       /* LVR reset enable */
#define  FLASH_USER_POR_DELAY               ((uint32_t)0x00FF0000)       /* Delay time of CPU reset after POR is triggered */

/**  Bit definition for FLASH_VTOR register  **/
#define  FLASH_VTOR_EN                      ((uint32_t)0x80000000)       /* VTOR enalbe */
#define  FLASH_VTOR_VALUE                   ((uint32_t)0x7FFFFFFF)       /* VTOR address value */



/*** Option Bytes register ***/

/**  Bit definition for FLASH_RDP register  **/
#define  FLASH_RDP_RDP1                      ((uint32_t)0x000000FF)        /* Read protection option byte */
#define  FLASH_RDP_nRDP1                     ((uint32_t)0x0000FF00)        /* Read protection complemented option byte */

/**  Bit definition for FLASH_USER register  **/
#define  FLASH_USER_USER                     ((uint32_t)0x00FF0000)        /* User option byte */
#define  FLASH_USER_nUSER                    ((uint32_t)0xFF000000)        /* User complemented option byte */

/**  Bit definition for FLASH_Data0 register  **/
#define  FLASH_Data0_Data0                   ((uint32_t)0x000000FF)        /* User data storage option byte */
#define  FLASH_Data0_nData0                  ((uint32_t)0x0000FF00)        /* User data storage complemented option byte */

/**  Bit definition for FLASH_Data1 register  **/
#define  FLASH_Data1_Data1                   ((uint32_t)0x00FF0000)        /* User data storage option byte */
#define  FLASH_Data1_nData1                  ((uint32_t)0xFF000000)        /* User data storage complemented option byte */

/**  Bit definition for FLASH_WRP0 register  **/
#define  FLASH_WRP0_USER2                     ((uint32_t)0x000000FF)        /* User2 option byte */
#define  FLASH_WRP0_nUSER2                    ((uint32_t)0x0000FF00)        /* User2 complemented option byte */

/**  Bit definition for FLASH_WRP1 register  **/
#define  FLASH_WRP1_USER3                     ((uint32_t)0x00FF0000)        /* User3 option byte */
#define  FLASH_WRP1_nUSER3                    ((uint32_t)0xFF000000)        /* User3 complemented option byte */

/**  Bit definition for FLASH_WRP3 register  **/
#define  FLASH_WRP3_USER4                     ((uint32_t)0x00FF0000)        /* User4 option byte */
#define  FLASH_WRP3_nUSER4                    ((uint32_t)0xFF000000)        /* User4 complemented option byte */

/**  Bit definition for FLASH_RDP2 register  **/
#define  FLASH_RDP_RDP2                      ((uint32_t)0x000000FF)        /* Read protection level 2 option byte */
#define  FLASH_RDP_nRDP2                     ((uint32_t)0x0000FF00)        /* Read protection level 2 complemented option byte */



/** Bit Offset register **/
#define REG_BIT1_OFFSET    ((uint32_t)0x00000001)
#define REG_BIT2_OFFSET    ((uint32_t)0x00000002)
#define REG_BIT3_OFFSET    ((uint32_t)0x00000003)
#define REG_BIT4_OFFSET    ((uint32_t)0x00000004)
#define REG_BIT5_OFFSET    ((uint32_t)0x00000005)
#define REG_BIT6_OFFSET    ((uint32_t)0x00000006)
#define REG_BIT7_OFFSET    ((uint32_t)0x00000007)
#define REG_BIT8_OFFSET    ((uint32_t)0x00000008)
#define REG_BIT9_OFFSET    ((uint32_t)0x00000009)
#define REG_BIT10_OFFSET   ((uint32_t)0x0000000A)
#define REG_BIT11_OFFSET   ((uint32_t)0x0000000B)
#define REG_BIT12_OFFSET   ((uint32_t)0x0000000C)
#define REG_BIT13_OFFSET   ((uint32_t)0x0000000D)
#define REG_BIT14_OFFSET   ((uint32_t)0x0000000E)
#define REG_BIT15_OFFSET   ((uint32_t)0x0000000F)
#define REG_BIT16_OFFSET   ((uint32_t)0x00000010)
#define REG_BIT17_OFFSET   ((uint32_t)0x00000011)
#define REG_BIT18_OFFSET   ((uint32_t)0x00000012)
#define REG_BIT19_OFFSET   ((uint32_t)0x00000013)
#define REG_BIT20_OFFSET   ((uint32_t)0x00000014)
#define REG_BIT21_OFFSET   ((uint32_t)0x00000015)
#define REG_BIT22_OFFSET   ((uint32_t)0x00000016)
#define REG_BIT23_OFFSET   ((uint32_t)0x00000017)
#define REG_BIT24_OFFSET   ((uint32_t)0x00000018)
#define REG_BIT25_OFFSET   ((uint32_t)0x00000019)
#define REG_BIT26_OFFSET   ((uint32_t)0x0000001A)
#define REG_BIT27_OFFSET   ((uint32_t)0x0000001B)
#define REG_BIT28_OFFSET   ((uint32_t)0x0000001C)
#define REG_BIT29_OFFSET   ((uint32_t)0x0000001D)
#define REG_BIT30_OFFSET   ((uint32_t)0x0000001E)
#define REG_BIT31_OFFSET   ((uint32_t)0x0000001F)
#define REG_BIT32_OFFSET   ((uint32_t)0x00000020)



#ifdef USE_STDPERIPH_DRIVER
  #include "bsp/n32g003/library/n32g003_conf.h"
#endif

/*** Exported_macro ***/

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))



#ifdef __cplusplus
}
#endif

#endif /* __n32g003_H */




